Q1. List any five functions of the pandas library with execution.

In [ ]:
##1. read_csv()
#The read_csv() function reads a comma-separated values (CSV) file into a Pandas DataFrame.

import pandas as pd

# Read the CSV file into a DataFrame
df = pd.read_csv('data.csv')

# Print the DataFrame
print(df)

In [ ]:
#2. head()
#The head() function returns the first five rows of a DataFrame.

# Print the first five rows of the DataFrame
print(df.head())

In [ ]:
#3. tail()#The tail() function returns the last five rows of a DataFrame.

# Print the last five rows of the DataFrame
print(df.tail())

In [ ]:
#4. describe()
#The describe() function provides a summary of the statistics of a DataFrame.

# Print a summary of the statistics of the DataFrame
print(df.describe())

In [ ]:
#5. merge()
#The merge() function merges two DataFrames together.

# Merge the two DataFrames together
df = pd.merge(df1, df2, on='key')

# Print the merged DataFrame
print(df)

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [35]:
data = {"A":[1,2,3,4],
      "B":[5,6,7,8]
     }

In [36]:
df = pd.DataFrame(data)

In [37]:
df

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [38]:
new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)

In [39]:
df = df.reindex(new_index)

In [40]:
df

     A    B
1  2.0  6.0
3  4.0  8.0
5  NaN  NaN
7  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [52]:
data1 = {"Values":[10,20,30,40,50],
       "Age":[4,5,6,7,8],
       "Name":["Komal" , "Ram","Shyam","navin","Shivam"]}

In [53]:
df= pd.DataFrame(data1)

In [54]:
df

   Values  Age    Name
0      10    4   Komal
1      20    5     Ram
2      30    6   Shyam
3      40    7   navin
4      50    8  Shivam

In [55]:
df.head(3)

   Values  Age   Name
0      10    4  Komal
1      20    5    Ram
2      30    6  Shyam

In [63]:
values_column = df[["Values"]].head(3)

In [64]:
values_column

   Values
0      10
1      20
2      30

In [65]:
values_column.head(3).sum()

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [97]:
data2 = {'Text':['i can not see','you are Wrong','you can Sing',]}

In [98]:
df=pd.DataFrame(data2)

In [99]:
df

            Text
0  i can not see
1  you are Wrong
2   you can Sing

In [100]:
df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))

In [101]:
df

            Text  Word_Count
0  i can not see           4
1  you are Wrong           3
2   you can Sing           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

ANS-The size() and shape() functions in Pandas are both used to get information about the dimensions of a DataFrame. However, there are some key differences between the two functions.
size(): returns the total number of elements in the DataFrame, including both missing and non-missing values.
**shape()` returns a tuple of two integers, representing the number of rows and columns in the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

ANS-read_excel function of pandas  we use to read an excel file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [75]:
data3={'Email':['johndoe@gmail.com','komalsingh@gmail.com']}

In [76]:
df = pd.DataFrame(data3)

In [77]:
df

                  Email
0     johndoe@gmail.com
1  komalsingh@gmail.com

In [90]:
df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])

In [91]:
df

                  Email    Username
0     johndoe@gmail.com     johndoe
1  komalsingh@gmail.com  komalsingh

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [ ]:
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [ ]:
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [17]:
data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}

In [18]:
df = pd.DataFrame(data)

In [15]:
selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]

In [16]:
selected_rows

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [9]:
df = {'Values':[22,34,56,80,87,44]}

In [12]:
data = pd.DataFrame(df)

In [13]:
data

   Values
0      22
1      34
2      56
3      80
4      87
5      44

In [14]:
data['Values'].mean()

53.833333333333336

In [16]:
data['Values'].median()

50.0

In [17]:
data['Values'].std()

25.66255378302531

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame.

In [5]:
data1 = {'Date': ['2023-03-01', '2023-03-02', '2023-03-03', '2023-03-04', '2023-03-05','2023-03-05','2023-03-06','2023-03-07'],
                   'Sales': [100, 150, 200, 250, 300,350,400,450]}

In [4]:
df1 = pd.DataFrame(data1)

In [7]:
df1['MovingAverage'] = df1['Sales'].rolling(window=7, min_periods=1).mean()

In [8]:
df1

         Date  Sales  MovingAverage
0  2023-03-01    100          100.0
1  2023-03-02    150          125.0
2  2023-03-03    200          150.0
3  2023-03-04    250          175.0
4  2023-03-05    300          200.0
5  2023-03-05    350          225.0
6  2023-03-06    400          250.0
7  2023-03-07    450          300.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [ ]:
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [19]:
df = pd.DataFrame({"Date" : ['2023-01-01' , '2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06']})

In [23]:
df['Date'] = pd.to_datetime(df['Date'])

In [28]:
df['weekday'] = df['Date'].dt.day_name()

In [29]:
df

        Date    weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [35]:
df['Date'] = pd.to_datetime(df['Date'])

In [41]:
data1= df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

In [42]:
data1

        Date    weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

ANS-The first and foremost library that needs to be imported to use the basic functions of pandas is pandas itself.